<?php
//
// Command: /nsfw #
// Text: /nsfw #
// Info: Розшифрування NSFW #
// Syntax: /nsfw #
// Args: 0 #
// Rank: USER #
//
use api\update as update;
$chat->sendMessage('ℹ Нагадуємо, що в нашому чаті <b>строго заборонено розповсюдження контенту, позначеного як NSFW (Not Safe For Work).</b> Це означає, що будь-які матеріали, які можуть бути невідповідними або небажаними для перегляду в робочому чи публічному середовищі, включаючи, але не обмежуючись сексуальними, провокативними зображеннями або текстами, грубою мовою та іншими подібними вмістами, не повинні бути публіковані у цьому чаті.

Порушення цього правила може призвести до негайних заходів, включаючи видалення контенту та/або тимчасове або постійне блокування користувача.

<b>Будьте відповідальними та поважайте інших учасників чату.</b>', update::$message_id);